package _02_04

// 2.4 List and Map definitions

//region list
//----------------------------------------------------------------------------------------------------
def list01 = ["A", "B", "C"]
assert list01.size() == 3
assert list01 instanceof ArrayList
//----------------------------------------------------------------------------------------------------
//endregion

//region map
//----------------------------------------------------------------------------------------------------
def map01 = [x: 1, y: 2]
assert map01 instanceof LinkedHashMap

// 直接通过 obj.key 访问某个 value,
assert map01.x == 1

assert map01.x instanceof Integer
//----------------------------------------------------------------------------------------------------
//endregion
